import React from 'react';
import './App.css';

function App() {
  return (
    <div className="App">
      <header>
        <h1>יפעת גרבר</h1>
          <h3>פסיכותרפיסטית ומטפלת במוסיקה</h3>
        {/*<nav>*/}
        {/*  <a href="#about">אודות</a>*/}
        {/* <a href="#services">סוגי טיפול</a>*/}
        {/* <a href="#beliefs">אני מאמין</a>*/}
        {/*  <a href="#background">רקע וניסיון מקצועי</a>*/}
        {/*  <a href="#education">השכלה אקדמאית והכשרות</a>*/}
        {/*  <a href="#contact">צור קשר</a>*/}
        {/*</nav>*/}
      </header>
      <section id="about">
        <h2>אודות</h2>
        <p><b>התמחויות: </b>
            אבל ואובדן, בעיות התנהגות, דימוי עצמי / בטחון עצמי, הריון ולידה, טיפול במשברים ושינויים, לחץ וחרדה</p>
        <p><b>שפות: </b>
            עברית</p>
      </section>
        <section id="services">
            <h2>סוגי טיפול</h2>
            <p>טיפול במתבגרים (רגשי / פסיכולוגי)</p>
            <p>טיפול פסיכולוגי / טיפול רגשי (למבוגרים מעל 18)</p>
            <p>טיפול רגשי לילדים / פסיכולוג ילדים</p>
        </section>
      <section id='beliefs'>
        <h2>אני מאמין</h2>
        <p>מאמינה בתהליכי צמיחה אישית, וביכולת של קשר עמוק ומשמעותי שנוצר בטיפול לחולל שינויים והטבה באיכות החיים וברווחה הנפשית. אני מאמינה בתפיסה אינטגרטיבית המשלבת טיפול פסיכו-דינמי יחד עם שילוב כלים מעולם ה-CBT. בטיפול מתקיים שיח, כאשר ישנה אפשרות לעשות שימוש באמצעים אמנותיים ומשחקיים, ובשפת המוסיקה, באופן גמיש ובהתאם לרצון ומטרות הטיפול.</p>
        <p>בתפיסה שלי אני שואפת ליצור חיבורים בין גוף לנפש, בין עולם פנימי לעולם חיצוני, ומשתמשת במידת הצורך בכלים מעולם המייינדפולנס, דמיון מודרך, הרפיות ונשימה. אני מאמינה שמתוך הקשבה פנימה וקבלה של עצמינו נוצרים תנועה, שינוי והתפתחות.</p>
      </section>

      <section id="background">
        <h2>רקע וניסיון מקצועי</h2>
        <p>יש לי נסיון רב שנים בטיפול בילדים, מתבגרים ועבודה עם הורים. טיפול בילדים עם קשיי קשב וריכוז, קשיי למידה, חרדות, התמודדות נפשית עקב משברי חיים, אבדן, מצבים משפחתיים מורכבים, ומצבי בריאות שונים.
          כמו כן, אני מטפלת דיאדית בקרב ילדים בני 3-8. במהלך השנים אף התנסיתי בטיפול הורה-ילד להורים לילדים צעירים יותר ואף תינוקות, שהיו מאושפזים במחלקת טיפול נמרץ בהדסה עין כרם. במסגרת הכשרתי בפסיכולוגיה רפואית עשיתי פרקטיקום במרפאת נשים בבי"ח הדסה עין כרם, שם טיפלתי בנשים ונערות במצבים רפואיים שונים, וכן נשים לאחר אובדן הריון/ לידה שקטה. התנסיתי בעבודה טיפולית במצבי משבר, אבל ואבדן, כאב פיזי, טראומה וחרדות. לצד טיפולים ארוכי טווח, יש לי נסיון בטיפולים קצרי מועד וממוקדים (12-15 פגישות). במהלך שנותי כמטפלת יצא לי להיחשף למגוון רחב של אוכלוסיות, ולטפל מתוך ראייה והתייחסות מותאמת תרבותית.</p>
      </section>

        <section id="education">
            <h2>השכלה אקדמאית והכשרות</h2>
            <p>תואר ראשון בפסיכולוגיה ומוסיקה (B.A) מאוניברסיטת בר אילן, ותואר שני בתרפיה במוסיקה (M.A), אוניברסיטת בר אילן. הכשרה שלוש שנתית בטיפול דיאדי (פסיכותרפיה הורה- ילד) מטעם האגודה הישראלית לטיפול הורה- ילד. כמו כן, מסיימת בימים אלה תואר שני נוסף בפסיכולוגיה רפואית (M.A) במכללה האקדמית תל אביב יפו, ולקראת התמחות.</p>
        </section>

        <section id="contact">
            <h2>צור קשר</h2>
            {/*button to whatsapp*/}
            <a href="https://wa.me/972528617041" target="_blank" rel="noopener noreferrer">
                <button className="whatsappButton">
                    <img src="https://img.icons8.com/color/48/000000/whatsapp.png" alt="whatsapp icon"/>
                </button>
                {/*   whatsapp icon */}

            </a>

        </section>

    </div>
  );
}

export default App;
